Revit 2026 API

# VertexIndexPair Properties

---

The VertexIndexPair type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Bottom | The index of the vertex pair from the bottom profile. |
|  | Top | The index of the vertex pair from the top profile. |

#### Reference

VertexIndexPair Class

Autodesk.Revit.DB Namespace